zodiac_signs = {
    'овен': {'март': (21, 31), 'апрель': (1, 19)},
    'телец': {'апрель': (20, 30), 'май': (1, 20)},
    'близнецы': {'май': (20, 31), 'июнь': (1, 21)},
    'рак': {'июнь': (21, 30), 'июль': (1, 22)},
    'лев': {'июль': (23, 31), 'август': (1, 22)},
    'дева': {'август': (23, 31), 'сентябрь': (1, 22)},
    'весы': {'сентябрь': (23, 30), 'октябрь': (1, 23)},
    'скорпион': {'октябрь': (24, 31), 'ноябрь': (1, 21)},
    'стрелец': {'ноябрь': (22, 30), 'декабрь': (1, 21)},
    'козерог': {'декабрь': (22, 31), 'январь': (1, 19)},
    'водолей': {'январь': (20, 31), 'февраль': (1, 18)},
    'рыбы': {'февраль': (19, 28), 'март': (1, 20)},
}